#### Pandas-DataFrame And Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [4]:
# Series
# A Panda series is a one-dimensional array-like object that can hold data type. it is similar to a columnin a table.
import pandas as pd
data = [100,200,300,400,500]
series = pd.Series(data)
print(series)
print(type(series))

0    100
1    200
2    300
3    400
4    500
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
# Create a series from dictionary
data = {"a":1,"b":2,"c":3}
series_data=pd.Series(data)
print(series_data)

a    1
b    2
c    3
dtype: int64

In [13]:
data2 = [500,600,700,800]
index = ['a','b','c','d']
pd.Series(data2,index)

a    500
b    600
c    700
d    800
dtype: int64

In [24]:
# Dataframe
# Create a Dataframe from a dictionary of list
data = {
    'Name':["Souvik","Rohit","Surya"],
    'Age':[21,23,25],
    'City':["Kolkata","Delhi","Mumbai"]
}
df1=pd.DataFrame(data)
print(df1)

     Name  Age     City
0  Souvik   21  Kolkata
1   Rohit   23    Delhi
2   Surya   25   Mumbai

In [11]:
import pandas as pd
df= pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [12]:
df.tail(6)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
234,10235,2024-08-22,Electronics,Bose QuietComfort 35 II Wireless Headphones,1,299.00,299.00,North America,Credit Card
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [25]:
df1

     Name  Age     City
0  Souvik   21  Kolkata
1   Rohit   23    Delhi
2   Surya   25   Mumbai

In [27]:
df1['Name']

0    Souvik
1     Rohit
2     Surya
Name: Name, dtype: object

In [29]:
df1.loc[0]

Name     Souvik
Age          21
City    Kolkata
Name: 0, dtype: object

In [30]:
df1.iloc[0]

Name     Souvik
Age          21
City    Kolkata
Name: 0, dtype: object

In [31]:
df1

     Name  Age     City
0  Souvik   21  Kolkata
1   Rohit   23    Delhi
2   Surya   25   Mumbai

In [33]:
# Accessing a specific element
df1.at[2,'Age']

25

In [34]:
df1.at[1,"Name"]

'Rohit'

In [35]:
# Accessing a specific element using iat
df1.iat[2,2]

'Mumbai'

In [37]:
# Adding a column
df1["Salary"]=[500000,600000,700000]
df1

     Name  Age     City  Salary
0  Souvik   21  Kolkata  500000
1   Rohit   23    Delhi  600000
2   Surya   25   Mumbai  700000

In [ ]:

## Remove a column
df1.drop('Salary',axis=1,inplace=True)

In [48]:
df1

     Name  Age     City
0  Souvik   21  Kolkata
1   Rohit   23    Delhi
2   Surya   25   Mumbai

In [61]:
# add age to the column
df1['Age']=df1['Age']+1
df1

     Name  Age     City
0  Souvik   22  Kolkata
1   Rohit   24    Delhi
2   Surya   26   Mumbai

In [62]:
df1.drop(1,inplace=True)
df1

     Name  Age     City
0  Souvik   22  Kolkata
2   Surya   26   Mumbai

In [63]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [64]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [65]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000